

//=================================================================================================
//                     НАЧАЛО ОБРАБОТКИ НАЖАТИЯ КЛАВИШ ВВЕРХ/ВНИЗ.      
void NajatieUpDownLeftRight() {


if (KB.getNum==8){   //Однократное нажатие кнопки DOWN "вниз"
        m++;                                            //увеличиваем переменную уровня меню
        lcd.clear();
        if (m>20) {m=20;}}                                //если уровень больше ..., то оставаться на значении ....
        
if (KB.getNum==2){    //Однократное нажатие кнопки UP "вверх"
        m--;                                            //уменьшаем переменную уровня меню
        lcd.clear();
        if (m<0) {m=0;}}                                //если уровень меньше 0, то оставаться на значении 0.
        

 }
      
    
  

//                    КОНЕЦ ОБРАБОТКИ НАЖАТИЯ КЛАВИШ ВВЕРХ/ВНИЗ.
//=================================================================================================
   
