//=================================================================================================
//                    НАЧАЛО СЧИТЫВАНИЯ ПОКАЗАНИЙ С DS18B20.
int ds18()
   {

byte data[2];
ds.reset(); 
ds.write(0xCC);
ds.write(0x44);
ds.reset();
ds.write(0xCC);
ds.write(0xBE);
data[0] = ds.read(); 
data[1] = ds.read();
int Temp = (data[1]<< 8)+data[0];
Temp = Temp>>4;
return Temp;

} //                    КОНЕЦ СЧИТЫВАНИЯ ПОКАЗАНИЙ С DS18B20.
//================================================================================================= 
//=================================================================================================
//                    НАЧАЛО СЧИТЫВАНИЯ ПОКАЗАНИЙ С ДАТЧИКА УРОВНЯ ЖИДКОСТИ. (+ преобразования)
void WaterSensorVolume()
   {
sensorVolume = analogRead(A2);
sensorVolumePercent = map(sensorVolume, 0, 1023, 0, 100);  



} //                    НАЧАЛО СЧИТЫВАНИЯ ПОКАЗАНИЙ С ДАТЧИКА УРОВНЯ ЖИДКОСТИ. (+ преобразования)
//================================================================================================= 
